# Quick Overview

In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {'name': ['harry', 'rohan','skillf','shubh'],
        'marks': [92,34,24,17],
        'city': ['rampur','kolkata','bareilly','antarctica']}

In [5]:
df = pd.DataFrame(dict1)
df

     name  marks        city
0   harry     92      rampur
1   rohan     34     kolkata
2  skillf     24    bareilly
3   shubh     17  antarctica

In [6]:
df.to_csv('friends.csv')

In [7]:
df.to_csv('friends_index_false.csv',index = False)

In [8]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.tail(2)

     name  marks        city
2  skillf     24    bareilly
3   shubh     17  antarctica

In [10]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [17]:
harry = pd.read_csv('harry.csv')
harry

   Train No  Speed        City
0     12344     34      rampur
1     44332    123     kolkata
2    455443     67    bareilly
3    676856     87  antarctica

In [18]:
harry['Speed']  #column ko access karne ke liye column ka naam

0     34
1    123
2     67
3     87
Name: Speed, dtype: int64

In [29]:
harry.iloc[0]

Train No     12344
Speed           50
City        rampur
Name: first, dtype: object

In [21]:
harry['Speed'][0]

34

In [22]:
harry['Speed'][0] = 50

C:\Users\Bhanu Pratap Singh\AppData\Local\Temp\ipykernel_21996\805298609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed'][0] = 50

In [23]:
harry

   Train No  Speed        City
0     12344     50      rampur
1     44332    123     kolkata
2    455443     67    bareilly
3    676856     87  antarctica

In [24]:
harry.index = ['first','second','third','four']

In [25]:
harry

        Train No  Speed        City
first      12344     50      rampur
second     44332    123     kolkata
third     455443     67    bareilly
four      676856     87  antarctica

In [30]:
harry.loc['second']

Train No      44332
Speed           123
City        kolkata
Name: second, dtype: object

In [31]:
harry.iloc[1]

Train No      44332
Speed           123
City        kolkata
Name: second, dtype: object

# Pandas